БИТУправление_медицинским_центром_демо/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоИсходящее</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейСкрытыхКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПисьма</name>
    <type>
      <types>EnumRef.СтатусыИсходящегоЭлектронногоПисьма</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПослеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/CommonModules/УправлениеЭлектроннойПочтойКлиент/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Открывает вложенный файл электронного письма.
//
// Параметры:
//  Ссылка  - СправочникСсылка.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы,
//            СправочникСсылка.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы - ссылка на файл, который необходимо
//                                                                            открыть.
//
Процедура ОткрытьВложение(Ссылка, Форма) Экспорт

	РаботаСФайламиКлиент.ОткрытьФайл(Ссылка);
		
КонецПроцедуры

// Возвращает массив, содержащий структуры с информацией о контактах взаимодействия
// или участниках предмета взаимодействия.
// Параметры:
//  ТаблицаКонтактов - Документ.ТабличнаяЧасть - содержащая описания и ссылки на контакты взаимодействия
//                                               или участников предмета взаимодействия.
//
Функция ТаблицуКонтактовВМассив(ТаблицаКонтактов) Экспорт
	
	Результат = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаКонтактов Цикл
		Контакт = ?(ТипЗнч(СтрокаТаблицы.Контакт) = Тип("Строка"), Неопределено, СтрокаТаблицы.Контакт);
		Запись = Новый Структура(
		"Адрес, Представление, Контакт", СтрокаТаблицы.Адрес, СтрокаТаблицы.Представление, Контакт);
		Результат.Добавить(Запись);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыДляОтправкиPDFПриемаПоЭлектроннойПочте(Знач ПриемыКОтправке, Тема, Текст, Клиент, АдресWkhtmltopdf) Экспорт
	
	Если ТипЗнч(ПриемыКОтправке) <> Тип("Массив") Тогда
		Прием = ПриемыКОтправке;
		ПриемыКОтправке = Новый Массив;
		ПриемыКОтправке.Добавить(Прием);
	КонецЕсли;
	
	ВложениеHTML = Новый СписокЗначений();
	
	Если ПриемыКОтправке.Количество() > 0 Тогда
		
		ИмяВременногоКаталога = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
			ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов()) + "medical_examination");
		
		ФайлКаталог = Новый Файл(ИмяВременногоКаталога);
		Если ФайлКаталог.Существует() Тогда
			УдалитьФайлы(ИмяВременногоКаталога);
		КонецЕсли;
		СоздатьКаталог(ИмяВременногоКаталога);
		
		Поток = Новый ПотокВПамяти();
		ЗаписьДанных = Новый ЗаписьДанных(Поток);
		ЗаписьДанных.КодировкаТекста = КодировкаТекста.UTF8;
		ЕстьЗапись = Ложь;
		РазрывСтраницы = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстHTMLРазрывСтраницы(Ложь);
		
		ДанныеШаблонов = УправлениеЭлектроннойПочтой.ПолучитьДанныеШаблоновДляОтправкиПоЭлектроннойПочте(ПриемыКОтправке, Истина);
		
		Для Каждого ДанныеОсмотра Из ДанныеШаблонов.ТекстыОсмотров Цикл
			ПечатнаяВерсия = ?(ЕстьЗапись, РазрывСтраницы, "") + ДанныеОсмотра.ТекстОсмотра;
			
			Если ЗначениеЗаполнено(ПечатнаяВерсия) Тогда
				
				ПечатнаяВерсияDOM = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ПечатнаяВерсия);
				СписокКартинок = РаботаСDOMКлиентСервер.ПолучитьЭлементыПоИмени(ПечатнаяВерсияDOM, "IMG", Истина);
				
				мсКартинкиКУдалению = Новый Массив;
				Для Каждого ЭлементКартинка Из СписокКартинок Цикл
					
					ДобавленноеИзображение = ДанныеОсмотра.ДобавленныеИзображения.Получить(ЭлементКартинка.Источник);
					Если ДобавленноеИзображение <> Неопределено Тогда
						ЭлементКартинка.src = СтрШаблон("data:image/%1;base64,%2", ДобавленноеИзображение.Расширение, ДобавленноеИзображение.base64);
						Продолжить;
					КонецЕсли;
					
					Рисунок = ДанныеОсмотра.Рисунки.Получить(ЭлементКартинка.Источник);
					Если Рисунок <> Неопределено Тогда
						ЭлементКартинка.src = "data:image/png;base64," + Рисунок;
						Продолжить;
					КонецЕсли;
					
					Изображение = ДанныеШаблонов.КешИзображений.Получить(ЭлементКартинка.Идентификатор);
					Если Изображение = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ФайлКартинки = Новый Файл(ИмяВременногоКаталога + Изображение.Идентификатор + Изображение.Расширение);
					Изображение.Картинка.Записать(ФайлКартинки.ПолноеИмя);
					Если ФайлКартинки.Размер() <= 5*1024*1024 Тогда
						ЭлементКартинка.src = "file:///" + СтрЗаменить(ФайлКартинки.ПолноеИмя, "\", "/");
					Иначе
						мсКартинкиКУдалению.Добавить(ЭлементКартинка);
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого элКартинка Из мсКартинкиКУдалению Цикл
					Если Не РаботаСHTMLКлиентСервер.ЭлементПустой(элКартинка.ДокументВладелец)
						И Не РаботаСHTMLКлиентСервер.ЭлементПустой(элКартинка.РодительскийУзел)
					Тогда
						элКартинка.РодительскийУзел.УдалитьДочерний(элКартинка);
					КонецЕсли;
				КонецЦикла;
				
				ЗаписьДанных.ЗаписатьСтроку(РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ПечатнаяВерсияDOM));
				
				ЕстьЗапись = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьДанных.Закрыть();
		Если ЕстьЗапись Тогда // Избегаем пустых приемов
			РазмерПисьма = Поток.Размер()/1024;
			ДвоичныеДанныеHTML = Поток.ЗакрытьИПолучитьДвоичныеДанные();
			ФайлPDF = РаботаСШаблонамиHTMLКлиент.ПреобразоватьHTMLвPDF(ДвоичныеДанныеHTML, АдресWkhtmltopdf, Ложь);
			Если ФайлPDF <> Неопределено Тогда
				ВложениеHTML.Добавить(ФайлPDF, "Медицинская запись.pdf"); // Добавляем двоичные данные файла
			КонецЕсли;
		КонецЕсли;
		УдалитьФайлы(ИмяВременногоКаталога);
		
	КонецЕсли;
	
	Если ВложениеHTML.Количество() = 0 Тогда
		ВложениеHTML = Неопределено;
	КонецЕсли;
	
	Возврат УправлениеЭлектроннойПочтой.ПолучитьПараметрыОтправкиПриемаПоЭлектроннойПочте(ПриемыКОтправке, Тема, Текст, Клиент, ВложениеHTML);
	
КонецФункции

Процедура ОтправитьДокументПоЭлектроннойПочте(Форма) Экспорт
	
	Если Не РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Объект.ПометкаУдаления Тогда
		ПоказатьПредупреждение(, НСтр("ru='Невозможно отправить помеченный на удаление документ!'"), 15, НСтр("ru='Не удалось отправить'"));
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	НастройкиПараметров = Новый Структура("Тема, Текст, ДокументыОтправки, ФормироватьPDFНаКлиенте, АдресWkhtmltopdfНаКлиенте", "", "", Новый Массив, Ложь, Ложь);
	УправлениеЭлектроннойПочтой.ЗаполнитьНастройкиПараметровПисьма(Форма.Объект, НастройкиПараметров, ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки, 15, НСтр("ru='Не удалось отправить'"));
		Возврат;
	КонецЕсли;
	
	Если НастройкиПараметров.ФормироватьPDFНаКлиенте Тогда
		ПараметрыОтправления = ПолучитьПараметрыДляОтправкиPDFПриемаПоЭлектроннойПочте(НастройкиПараметров.ДокументыОтправки, НастройкиПараметров.Тема, НастройкиПараметров.Текст, Форма.Объект.Клиент, НастройкиПараметров.АдресWkhtmltopdfНаКлиенте);
	Иначе
		ПараметрыОтправления = УправлениеЭлектроннойПочтой.ПолучитьПараметрыОтправкиПриемаПоЭлектроннойПочте(НастройкиПараметров.ДокументыОтправки, НастройкиПараметров.Тема, НастройкиПараметров.Текст, Форма.Объект.Клиент);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыОтправления);
	// Если при формировании параметров отправления произошла ошибка, то выводим сообщение.
	Если ПараметрыОтправления.Свойство("СообщениеОбОшибке") Тогда
		Если Не ПустаяСтрока(ПараметрыОтправления.СообщениеОбОшибке) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ПараметрыОтправления.СообщениеОбОшибке);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
